# ServiceId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..ServiceId Property
FabricationPart Class See Also
---
The fabrication part service identifier. The service can only be changed to compatible services.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Release
# Syntax
C#
---
```text
public int ServiceId { get; set; }
```

Visual Basic
---
```text
Public Property ServiceId As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int ServiceId {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace